app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
    @muscles = Muscle.all
---
SELECT * FROM `exercises`
SELECT * FROM `muscles`

  def show
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 1)

  def new
    @exercise = Exercise.new
    @muscles = Muscle.all
---
SELECT * FROM `muscles`

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 2)

  def create
    @exercise = Exercise.new(params[:exercise])

    respond_to do |format|
      if @exercise.save
---
INSERT INTO `exercises` (`name`, `updated_at`, `muscle_id`, `created_at`) VALUES('Bench Press', '2010-03-18 14:17:05', 1, '2010-03-18 14:17:05')

  def update
    @exercise = Exercise.find(params[:id])

    respond_to do |format|
      if @exercise.update_attributes(params[:exercise])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 2)
UPDATE `exercises` SET `updated_at` = '2010-03-19 02:47:39', `name` = 'squats' WHERE `id` = 2