app/controllers/lifts_controller.rb

  def index

    #@lifts = Lift.paginate_by_user_id current_user.id, :page => params[:page], :order => 'created_at DESC'
    #@lifts = Lift.find_all_by_user_id(current_user.id, :order => 'created_at DESC')
    @lifts=current_user.lifts(:page => params[:page], :include => [:exercise => :muscle], :order => 'lifts.created_at DESC').sort_by(&:created_at).reverse
    #@lifts = Lift.paginate_by_user_id (current_user.id, :page => params[:page], :include => [:exercise => :muscle], :order => 'created_at DESC')
    #@lifts=Lift.find_all_by_user_id(current_user.id, :include => [:exercise => :muscle], :order => 'created_at DESC')
    @todaylifts = Lift.find_all_by_user_id(current_user.id, :order => 'created_at DESC')

    @lift = Lift.new
    @exercises = Exercise.all
---
SELECT * FROM `exercises`

  def show
    @lift = Lift.find(params[:id])
---
SELECT * FROM `lifts` WHERE (`lifts`.`id` = 1)

  def new
    @lift = Lift.new
    @exercises = Exercise.all
---
SELECT * FROM `exercises`

  def edit
    @lifts = Lift.find(:all, :order => 'created_at')
    @exercises = Exercise.all
---
SELECT * FROM `lifts` WHERE (`lifts`.`id` = 7)
SELECT * FROM `exercises`

  def create
    @lift = Lift.new(params[:lift])
    @lifts=current_user.lifts(:page => params[:page], :include => [:exercise => :muscle], :order => 'lifts.created_at DESC').sort_by(&:created_at).reverse
---
INSERT INTO `lifts` (`updated_at`, `exercise_id`, `weight`, `user_id`, `created_at`) VALUES('2010-03-18 14:31:18', 1, 122, 1, '2010-03-18 14:31:18')

  def update
    @lift = Lift.find(params[:id])

    respond_to do |format|
      if @lift.update_attributes(params[:lift])
---
SELECT * FROM `lifts` WHERE (`lifts`.`id` = 17)
UPDATE `lifts` SET `weight` = 1234, `updated_at` = '2010-03-20 00:23:51' WHERE `id` = 17

  def destroy
    @lift = Lift.find(params[:id])
    @lift.destroy
---
SELECT * FROM `lifts` WHERE (`lifts`.`id` = 2)
DELETE FROM `lifts` WHERE `id` = 2