app/controllers/reports_controller.rb

SELECT * FROM `exercises`
---
def progress
    @lifts = Lift.find(:all, :order => 'created_at')
    @exercises = Exercise.all